# VertexIndexPairArray Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexIndexPairArray Constructor
VertexIndexPairArray Class See Also
---
Initializes a new instance of the VertexIndexPairArray class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public VertexIndexPairArray()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
VertexIndexPairArray()
```

# See Also
VertexIndexPairArray Class
Autodesk.Revit.DB Namespace